# Data Preprocessing

# Outline
- One hot encoding
- Feature engineering

In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv('employee_attrition.csv')

In [2]:
df.head()

,Age,Attrition,BusinessTravel,DailyRate,DistanceFromHome,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,...,PerformanceRating,RelationshipSatisfaction,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,1,2,Female,94,3,2,...,3,1,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,8,3,Male,61,2,2,...,4,4,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,2,4,Male,92,2,1,...,3,2,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,3,4,Female,56,3,1,...,3,3,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,2,1,Male,40,3,1,...,3,4,1,6,3,3,2,2,2,2

## One hot encoding

In [3]:
##  Creating dummy variables for categorical variables for modeling
df1 =  pd.get_dummies(df, columns = ['JobSatisfaction', 'JobInvolvement', 'EnvironmentSatisfaction','BusinessTravel'], drop_first=True)

In [4]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 33 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Age                               1470 non-null   int64
 1   Attrition                         1470 non-null   object
 2   DailyRate                         1470 non-null   int64
 3   DistanceFromHome                  1470 non-null   int64
 4   Gender                            1470 non-null   object
 5   HourlyRate                        1470 non-null   int64
 6   JobLevel                          1470 non-null   int64
 7   MaritalStatus                     1470 non-null   object
 8   MonthlyIncome                     1470 non-null   int64
 9   NumCompaniesWorked                1470 non-null   int64
 10  OverTime                          1470 non-null   object
 11  PercentSalaryHike                 1470 non-null   int64
 12  PerformanceRating                 1470 non-null   int64
 13  RelationshipSatisfaction          1470 non-null   int64
 14  StockOptionLevel                  1470 non-null   int64
 15  TotalWorkingYears                 1470 non-null   int64
 16  TrainingTimesLastYear             1470 non-null   int64
 17  WorkLifeBalance                   1470 non-null   int64
 18  YearsAtCompany                    1470 non-null   int64
 19  YearsInCurrentRole                1470 non-null   int64
 20  YearsSinceLastPromotion           1470 non-null   int64
 21  YearsWithCurrManager              1470 non-null   int64
 22  JobSatisfaction_2                 1470 non-null   uint8
 23  JobSatisfaction_3                 1470 non-null   uint8
 24  JobSatisfaction_4                 1470 non-null   uint8
 25  JobInvolvement_2                  1470 non-null   uint8
 26  JobInvolvement_3                  1470 non-null   uint8
 27  JobInvolvement_4                  1470 non-null   uint8
 28  EnvironmentSatisfaction_2         1470 non-null   uint8
 29  EnvironmentSatisfaction_3         1470 non-null   uint8
 30  EnvironmentSatisfaction_4         1470 non-null   uint8
 31  BusinessTravel_Travel_Frequently  1470 non-null   uint8
 32  BusinessTravel_Travel_Rarely      1470 non-null   uint8
dtypes: int64(18), object(4), uint8(11)
memory usage: 268.6+ KB

In [5]:
df1.head()

,Age,Attrition,DailyRate,DistanceFromHome,Gender,HourlyRate,JobLevel,MaritalStatus,MonthlyIncome,NumCompaniesWorked,...,JobSatisfaction_3,JobSatisfaction_4,JobInvolvement_2,JobInvolvement_3,JobInvolvement_4,EnvironmentSatisfaction_2,EnvironmentSatisfaction_3,EnvironmentSatisfaction_4,BusinessTravel_Travel_Frequently,BusinessTravel_Travel_Rarely
0,41,Yes,1102,1,Female,94,2,Single,5993,8,...,0,1,0,1,0,1,0,0,0,1
1,49,No,279,8,Male,61,2,Married,5130,1,...,0,0,1,0,0,0,1,0,1,0
2,37,Yes,1373,2,Male,92,1,Single,2090,6,...,1,0,1,0,0,0,0,1,0,1
3,33,No,1392,3,Female,56,1,Married,2909,1,...,1,0,0,1,0,0,0,1,1,0
4,27,No,591,2,Male,40,1,Married,3468,9,...,0,0,0,1,0,0,0,0,0,1

## Feature Engineering

In [6]:
###  Creating relevant features that are combinations of other features.
##  percent salary hike may not be as relevant as the total dollar amount of the increase.

df1['NewFeatureDollarHike'] = (df1['PercentSalaryHike']/100)*df1['MonthlyIncome']

In [7]:
df1.head()

,Age,Attrition,DailyRate,DistanceFromHome,Gender,HourlyRate,JobLevel,MaritalStatus,MonthlyIncome,NumCompaniesWorked,...,JobSatisfaction_4,JobInvolvement_2,JobInvolvement_3,JobInvolvement_4,EnvironmentSatisfaction_2,EnvironmentSatisfaction_3,EnvironmentSatisfaction_4,BusinessTravel_Travel_Frequently,BusinessTravel_Travel_Rarely,NewFeatureDollarHike
0,41,Yes,1102,1,Female,94,2,Single,5993,8,...,1,0,1,0,1,0,0,0,1,659.23
1,49,No,279,8,Male,61,2,Married,5130,1,...,0,1,0,0,0,1,0,1,0,1179.90
2,37,Yes,1373,2,Male,92,1,Single,2090,6,...,0,1,0,0,0,0,1,0,1,313.50
3,33,No,1392,3,Female,56,1,Married,2909,1,...,0,0,1,0,0,0,1,1,0,319.99
4,27,No,591,2,Male,40,1,Married,3468,9,...,0,0,1,0,0,0,0,0,1,416.16